{
   "data":
      [
         { 
            "id": 1,
            "destination":
               {
                  "city": "Porto",
                  "country": "Portugal",
                  "continent": "Europe"
               },
            "checkin": "2020-01-03",
            "checkout": "2022-02-03",
            "coverIMG": "/images/porto.png",
            "lat": 41.157944,
            "lon": -8.629105,
            "description": "Porto, located in northern Portugal, is a charming city known for its colourful streets, magnificent architecture, and world-famous wine. \n With its stunning riverside location, historic landmarks such as the Dom Luís I Bridge and the Ribeira District, and a vibrant food scene, Porto is a delightful destination for any traveler seeking a mix of culture, history, and culinary delights.",
            "sliderIMG": [
               "/images/porto1.jpg",
               "/images/porto2.jpg",
               "/images/porto3.jpg"
            ]
         },
         {
            "id": 2,
            "destination":
               {
                  "city": "Lisbon",
                  "country": "Portugal",
                  "continent": "Europe"
               },
            "checkin": "2002-08-23",
            "checkout": "2002-08-29",
            "coverIMG": "/images/lisbon.png",
            "lat": 38.707751,
            "lon": -9.136592,
            "description": "Lisbon, the capital city of Portugal, offers a perfect blend of old-world charm and modern vibrancy. \n This enchanting city is renowned for its picturesque streets, iconic yellow trams, and breathtaking views from its numerous viewpoints. \n With its rich history, stunning landmarks like the Belém Tower and Jerónimos Monastery, lively neighbourhoods such as Alfama and Bairro Alto, as well as delectable Portuguese cuisine, Lisbon is a captivating destination for every explorer."
         },
         {
            "id": 3,
            "destination":
               {
                  "city": "Brussels",
                  "country": "Belgium",
                  "continent": "Europe"
               },
            "checkin": "2023-03-15",
            "checkout": "2023-03-21",
            "coverIMG": "/images/brussels.png",
            "lat": 50.846557,
            "lon": 4.351697,
            "description": "As the heart of Europe, Brussels captivates visitors with its unique blend of history, culture, and international allure. \n Famous for its stunning architecture, including the iconic Atomium and the Grand Place, this multicultural city is also home to the European Parliament and an abundance of museums and art galleries. \n Visitors can indulge in world-class chocolate, waffles, and beer, while exploring the charming streets of the city's diverse neighbourhoods."
         },
         {
            "id": 4,
            "destination":
               {
                  "city": "Dublin",
                  "country": "Ireland",
                  "continent": "Europe"
               },
            "checkin": "2019-10-02",
            "checkout": "2019-11-21",
            "coverIMG": "/images/dublin.png",
            "lat": 53.349764,
            "lon": -6.260273,
            "description": "Dublin, the lively capital of Ireland, combines rich history with a vibrant atmosphere. \n With its literary heritage, including connections to renowned writers such as James Joyce and Oscar Wilde, the city offers a multitude of literary landmarks and bustling pubs where traditional Irish music fills the air. \n From exploring the historic Trinity College and strolling along the beautiful River Liffey to experiencing the warm Irish hospitality, Dublin promises an unforgettable experience for all."
         },
         {
            "id": 5,
            "destination":
               {
                  "city": "Paris",
                  "country": "France",
                  "continent": "Europe"
               },
            "checkin": "2009-01-29",
            "checkout": "2009-02-04",
            "coverIMG": "/images/paris.png",
            "lat": 48.856614,
            "lon": 2.352222,
            "description": "Paris, the ''City of Love,'' is a dream destination for many travelers. \n With its world-famous landmarks like the Eiffel Tower, Louvre Museum, and Notre-Dame Cathedral, the city exudes an undeniable charm. \n Whether it's wandering through the charming neighbourhoods of Montmartre or Le Marais, indulging in exquisite French cuisine, or simply enjoying a leisurely stroll along the Seine River, Paris offers an unparalleled experience with its art, culture, and romantic atmosphere."
         },
         {
            "id": 6,
            "destination":
               {
                  "city": "Madrid",
                  "country": "Spain",
                  "continent": "Europe"
               },
            "checkin": "2023-08-29",
            "checkout": "2023-09-04",
            "coverIMG": "/images/madrid.png",
            "lat": 40.416705,
            "lon": -3.703582,
            "description": "Madrid, the vibrant capital of Spain, impresses visitors with its elegant boulevards, stunning architecture, and world-class museums. \n Home to the iconic Plaza Mayor, the sprawling Royal Palace, and three internationally renowned art museums called the Golden Triangle, Madrid offers a captivating blend of history, culture, and cosmopolitan flair. \n From savouring delicious tapas to experiencing thrilling flamenco shows, Madrid invites travelers to immerse themselves in the lively Spanish lifestyle."
         },
         {
            "id": 7,
            "destination":
               {
                  "city": "Barcelona",
                  "country": "Spain",
                  "continent": "Europe"
               },
            "checkin": "2016-11-22",
            "checkout": "2016-11-29",
            "coverIMG": "/images/barcelona.png",
            "lat": 41.387397,
            "lon": 2.168568,
            "description": "Barcelona, the enchanting coastal city in northeastern Spain, is a mosaic of art, architecture, and vibrant street life. \n With its awe-inspiring landmarks like the majestic Sagrada Familia, Park Güell, and Gothic Quarter, Barcelona seamlessly blends the avant-garde with its rich history. \n Visitors can soak up the sun on its beautiful beaches, indulge in world-class Catalan cuisine, or explore the bustling La Boqueria market. \n Barcelona's energetic atmosphere and unique blend of Catalan culture make it a must-visit destination."
         },
         {
            "id": 8,
            "destination":
               {
                  "city": "Stockholm",
                  "country": "Sweden",
                  "continent": "Europe"
               },
            "checkin": "2011-05-15",
            "checkout": "2011-05-21",
            "coverIMG": "/images/stockholm.png",
            "lat": 59.325117,
            "lon": 18.071093,
            "description": "Stockholm, the capital of Sweden, is known for its striking beauty, surrounded by an archipelago of islands. \n This elegant city offers a harmonious blend of medieval and modern architecture, from the historic Gamla Stan to the trendy Södermalm district. \n Visitors can explore world-class museums, admire stunning royal palaces, or simply relax in one of the many waterfront cafes. \n With its clean, green spaces and innovative design, Stockholm never fails to impress travelers seeking a mix of Scandinavian charm and urban sophistication."
         },
         {
            "id": 9,
            "destination":
               {
                  "city": "Luzern",
                  "country": "Switzerland",
                  "continent": "Europe"
               },
            "checkin": "2013-02-15",
            "checkout": "2013-02-25",
            "coverIMG": "/images/luzerne.png",
            "lat": 47.050545,
            "lon": 8.305468,
            "description": "Located in the heart of Switzerland, Luzern is a picturesque city surrounded by snow-capped mountains and crystal-clear lakes. \n Its well-preserved medieval architecture, including the iconic Chapel Bridge, blends seamlessly with modern amenities and a lively cultural scene. \n Visitors can enjoy breathtaking views from Mount Pilatus or Rigi, take a leisurely boat ride on Lake Lucerne, or simply wander through the city's charming cobblestone streets. \n Luzern is a tranquil and stunning destination for those looking to immerse themselves in Switzerland's natural beauty."
         },
         {
            "id": 10,
            "destination":
               {
                  "city": "Cannes",
                  "country": "France",
                  "continent": "Europe"
               },
            "checkin": "2022-03-07",
            "checkout": "2022-03-13",
            "coverIMG": "/images/cannes.png",
            "lat": 43.55152,
            "lon": 7.013442,
            "description": "Cannes, situated along the French Riviera, exudes elegance and glamour. \n Known for its prestigious film festival, this seaside resort town offers beautiful sandy beaches, luxurious boutiques, and a lively promenade lined with palm trees. \n Visitors can soak up the sun on the famous Croisette, admire stunning yachts in the harbour, or explore the historic Le Suquet neighbourhood. \n Whether indulging in delightful Provençal cuisine or enjoying a vibrant nightlife, Cannes promises a sophisticated and unforgettable experience."
         },
         {
            "id": 11,
            "destination":
               {
                  "city": "Cork",
                  "country": "Ireland",
                  "continent": "Europe"
               },
            "checkin": "2023-12-13",
            "checkout": "2023-12-18",
            "coverIMG": "/images/cork.png",
            "lat": 51.897928,
            "lon": -8.470581,
            "description": "Cork, located on the southwest coast of Ireland, is a charming city with a unique blend of traditional Irish charm and modern culture. \n With its lively pubs, historic sites like the iconic St. Fin Barre's Cathedral, and vibrant English Market, Cork offers visitors a taste of true Irish hospitality. \n Explore the narrow streets of the city's creative quarter, sample local whiskies and craft beers, or venture to the stunning coastline and landscapes of County Cork. \n Cork is a captivating destination that showcases the very best of Ireland."
         },
         {
            "id": 12,
            "destination":
               {
                  "city": "Bucharest",
                  "country": "Romania",
                  "continent": "Europe"
               },
            "checkin": "2023-09-29",
            "checkout": "2023-10-01",
            "coverIMG": "/images/bucharest.png",
            "lat": 44.436141,
            "lon": 26.10272,
            "description": "Bucharest, the capital city of Romania, is a vibrant metropolis filled with contrasts. \n From its mix of architectural styles, including the grand Palace of the Parliament and the old-world charm of Lipscani Quarter, to its trendy cafes and bustling nightlife, Bucharest offers a diverse and captivating experience. \n Visitors can explore the city's rich history, delve into its thriving arts and culture scene, or simply enjoy Romanian cuisine in one of its many lively restaurants. \n Bucharest is a city full of surprises, waiting to be discovered."
         }
      ]
}